Core/src/Documents/ИнвентаризацияОсновныхСредств/ИнвентаризацияОсновныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияОсновныхСредств</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеВнеоборотногоАктива</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяСтоимостьУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленнаяАмортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленнаяАмортизацияУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяСтоимостьУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомплектацияВА</name>
      <type>
        <types>DocumentRef.КомплектацияВА</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделении</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/ИнвентаризацияОсновныхСредств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Функция ТекстЗапросаУниверсальный()
	
	Возврат
	"ВЫБРАТЬ
	|	ИнвентаризацияОсновныхСредств.Ссылка КАК Ссылка,
	|	ИнвентаризацияОсновныхСредств.Номер КАК Номер,
	|	ИнвентаризацияОсновныхСредств.Дата КАК ДатаДокумента,
	|	ИнвентаризацияОсновныхСредств.Дата КАК ДатаНачалаИнвентаризации,
	|	ИнвентаризацияОсновныхСредств.Организация КАК Организация,
	|	ИнвентаризацияОсновныхСредств.Организация.Префикс КАК Префикс,
	|	ИнвентаризацияОсновныхСредств.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ИнвентаризацияОсновныхСредств КАК ИнвентаризацияОсновныхСредств
	|ГДЕ
	|	ИнвентаризацияОсновныхСредств.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнеоборотныеАктивы.НомерСтроки КАК Номер,
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ВнеоборотныеАктивы.ВнеоборотныйАктив.Код КАК Код,
	|	ВнеоборотныеАктивы.Отклонение КАК Отклонение,
	|	ВнеоборотныеАктивы.Количество КАК ФактКоличество,
	|	ВнеоборотныеАктивы.КоличествоУчет КАК БухКоличество,
	|	ВнеоборотныеАктивы.КонечнаяСтоимость КАК КонечнаяСтоимость,
	|	ВнеоборотныеАктивы.КонечнаяСтоимостьУчет КАК КонечнаяСтоимостьУчет,
	|	ВнеоборотныеАктивы.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ИнвентаризацияОсновныхСредств.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	|ГДЕ
	|	ВнеоборотныеАктивы.Ссылка = &ТекущийДокумент
	|	И ТИПЗНАЧЕНИЯ(ВнеоборотныеАктивы.Отклонение) = ТИП(ЧИСЛО)
	|ИТОГИ ПО
	|	Подразделение";
	
КонецФункции

Процедура СформироватьИнвентаризациюОсновныхСредст(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати)
	Перем ПервыйДокумент, НомерСтрокиНачало;
	
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	ДанныеПечати		= Новый Структура;	
	Запрос				= Новый Запрос(ТекстЗапросаУниверсальный());
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		ДанныеПечати.Очистить();
		
		Запрос.УстановитьПараметр("ТекущийДокумент",	ТекущийДокумент);
				
		РезультатЗапроса				= Запрос.ВыполнитьПакет();
		Шапка							= РезультатЗапроса[0].Выбрать();
		ВыборкаСтрокВнеоборотныеАктивы	= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
		Шапка.Следующий();
		
		
		ПараметрыВнеоборотныхАктивов = Новый Структура;
		
		Пока ВыборкаСтрокВнеоборотныеАктивы.Следующий() Цикл
			
			
			//:::Шапка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
			ШаблонЗаголовка = Нстр("ru = 'Инвентаризация oсновных cредств № %1 от %2'; ka = 'ძირითადი საშუალებების ინვენტარიზაცია № %1 от %2'; en = 'Инвентаризация oсновных cредств № %1 от %2'");
			
			ДанныеПечати.Вставить("ТекстЗаголовка", СтрШаблон(ШаблонЗаголовка, НомерДокумента, Формат(Шапка.ДатаДокумента, "ДЛФ=DD")));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		
			//:::Организация
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			
			СведенияОбОрганизации    = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
			ПредставлениеОрганизации = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
			
			ДанныеПечати.Очистить();
			ДанныеПечати.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
			ДанныеПечати.Вставить("Ответственный", Шапка.Ответственный); 
			ДанныеПечати.Вставить("Подразделение", ВыборкаСтрокВнеоборотныеАктивы.Подразделение);
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//:::Шапка таблицы
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
			
			КоличествоВсего = 0;
			КоличествоВсегоПоУчету = 0;
			СтоимостьВсего = 0;
			СтоимостьВсегоПоУчету = 0;
				
			ВыборкаПоПодразделениям = ВыборкаСтрокВнеоборотныеАктивы.Выбрать();		
			Пока ВыборкаПоПодразделениям.Следующий() Цикл 
				
				//:::Табличная часть
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ДанныеПечати.Очистить();
				
				ДанныеПечати.Вставить("ВнеоборотныйАктив", ВыборкаПоПодразделениям.ВнеоборотныйАктив);
				ДанныеПечати.Вставить("НомерСтроки", ВыборкаПоПодразделениям.Номер);
				ДанныеПечати.Вставить("Код", ВыборкаПоПодразделениям.Код);
				ДанныеПечати.Вставить("Отклонение", ВыборкаПоПодразделениям.Отклонение);
				ДанныеПечати.Вставить("Количество", ВыборкаПоПодразделениям.ФактКоличество);
				ДанныеПечати.Вставить("КоличествоПоУчету", ВыборкаПоПодразделениям.БухКоличество);
				ДанныеПечати.Вставить("КонечнаяСтоимость", ВыборкаПоПодразделениям.КонечнаяСтоимость);	
				ДанныеПечати.Вставить("КонечнаяСтоимостьУчет", ВыборкаПоПодразделениям.КонечнаяСтоимостьУчет);   	
				
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);   
				
				КоличествоВсего = КоличествоВсего + ВыборкаПоПодразделениям.ФактКоличество; 
				КоличествоВсегоПоУчету = КоличествоВсегоПоУчету + ВыборкаПоПодразделениям.БухКоличество;
				СтоимостьВсего = СтоимостьВсего + ВыборкаПоПодразделениям.КонечнаяСтоимость;
				СтоимостьВсегоПоУчету = СтоимостьВсегоПоУчету + ВыборкаПоПодразделениям.КонечнаяСтоимостьУчет;
			КонецЦикла; 		
			
			// Вывести Итого
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			
			ДанныеПечати.Очистить();
			ДанныеПечати.Вставить("КоличествоВсего", Формат(КоличествоВсего,"ЧЦ=15; ЧДЦ=2; ЧН=0"));
			ДанныеПечати.Вставить("КоличествоВсегоПоУчету", Формат(КоличествоВсегоПоУчету,"ЧЦ=15; ЧДЦ=2; ЧН=0")); 
			ДанныеПечати.Вставить("СтоимостьВсего", Формат(СтоимостьВсего,"ЧЦ=15; ЧДЦ=2; ЧН=0"));
			ДанныеПечати.Вставить("СтоимостьВсегоПоУчету", Формат(СтоимостьВсегоПоУчету,"ЧЦ=15; ЧДЦ=2; ЧН=0"));
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подписи к документу
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");	
			ДанныеПечати.Очистить();
			ТабличныйДокумент.Вывести(ОбластьМакета);   
			
			//:::ПустаяСтрока
			ОбластьМакета = Макет.ПолучитьОбласть("ПустаяСтрока");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ИнвентаризацияОсновныхСредств");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияОсновныхСредств";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ИнвентаризацияОсновныхСредств.ПФ_MXL_ИнвентаризацияОсновныхСредств";
		ПечатнаяФорма.СинонимМакета = НСтр("en='Inventarization';ka='ძირითადი საშუალებების ინვენტარიზაცია';ru='Инвентаризация основных средств'");
		
		СформироватьИнвентаризациюОсновныхСредст(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры
	
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИнвентаризацияОсновныхСредств";
	КомандаПечати.Представление = НСтр("en='Inventarization';ka='ძირითადი საშუალებების ინვენტარიზაცია';ru='Инвентаризация основных средств'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
